import PagesLayout from "../layouts/PagesLayout";

export default function Goals() {
  return (
    <PagesLayout pageClass="goals" title="الأهداف و المهام">
      <div className="box goals-box bg-white shadow-sm p-3 rounded-3">
        <div className="title pb-1 mb-1 border-bottom">المهام</div>
        <div className="info text-muted">
          الناظر هو المسؤول عن تنظيم وإدارة الوقف بمكة المكرمة وتطويره ومتابعة
          بدائل للأصول، من خلال مؤسسة مسجلة وفقا للأنظمة وذلك تحت إشراف الهيئة
          العامة للأوقاف، وبالتالي تحسين الإيرادات وضمان المبلغ المنفق على
          الإقامة المجانية للحجاج القادمين من ولاية حيدر أباد بالهند من خلال
          اختيار المستحقين عبر النظام الإلكتروني بالتنسيق مع البعثة الهندية.
        </div>
      </div>
      <div className="box missions-box bg-white shadow-sm p-3 rounded-3 mt-3">
        <div className="title pb-1 mb-3 border-bottom">الأهداف</div>
        <div className="info text-muted">
          <div>
            <h6 className="fw-bold">1. إدارة العقارات :</h6>
            <p className="mb-0">
              - ضمان الإستدامة على المدى الطويل لجميع أصول الوقف وتحسينها.
              <br />
              - ضمان استثمارات انتقائية للأصول من خلال موافقات المحاكم الشرعية.
              <br />
              - اتفاقيات تأجير مثالية على الأصول وفقا للقانون
              <br />
              - إشراف الإدارة من خلال أنظمة الموارد البشرية والقواعد التي تضعها
              المنظمه الحكومية المعنية
              <br />
              - ضمان الصيانة الدورية ورفاهية جميع الأصول الخاضعة للوقف في جميع
              الأوقات.
              <br />
              - المتابعة الفورية لجميع المستحقات والإيجارات للحصول على إيرادات
              متواصلة.
              <br />
              - العمل بموجب النظارة الصادرة من وزارة العدل بمحكمة مكة المكرمة
              لتشغيل مؤسسة لإدارة الوقف تحت إشراف الهيئة العامة للأوقاف.
              <br />
              - تسجيل و متابعة جميع المستندات المتعلقة بعقارات الوقف والإلتزام
              بالإجراءات التي تحددها الهيئة ذات العلاقة به.
              <br />
              - العمل بموجب السجل التجاري لتشغيل وإدارة مؤسسة اوقاف و أربطة
              النظام حيدرآباد.
              <br />
              - تحسين منظمة الوقف حسب القواعد المطلوبة وإدارة الوظائف الإدارية
              لتلبية الرؤية والرسالة المحددة للمؤسسة.
              <br />
              - الإحتفاظ بسجلات مالية لا تقل عن العشر السنوات الماضية معتمدة من
              قبل محاسب قانوني رسمي.
              <br />- تأمين وتحديث النظام المالي المناسب لتسجيل جميع المعاملات
              حسب احتياجات الوقف وبما يتماشى مع الأنظمة المختصة.
            </p>
          </div>
          <div className="mt-4">
            <h6 className="fw-bold"> 2. إدارة إسكان الحجاج:</h6>
            <p className="mb-0">
              - التخطيط لزيادة عدد الحجاج في كل عام وذلك من خلال تحسين
              الإيرادات.
              <br />
              - عقد اجتماعات منتظمة بالتنسيق مع السلطات الهندية لإطلاعها على
              كافة متطلبات إسكان الحجاج.
              <br />
              - المشاركة مع البعثة الهندية في السحب السنوي بشكل شفاف وذلك
              لإختيار الحجاج من قائمة المستحقين حسب العدد المطلوب.
              <br />
              - اختيار عمائر موسمية مناسبه لإقامة الحجاج
              <br />
              - تشكيل فريق سعودي يتحدثون اللغة الهندية للإشراف على الخدمات
              المقدمة للحجاج في الحج وذلك حسب المتفق.
              <br />
              - استقبال الحجاج من الهند وذلك حسب تواريخ الوصول المحددة وإيوائهم
              حتى مغادرتهم إلى المشاعر
              <br />
              - استقبال الحجاج من المشاعر حسب تواريخ الوصول وإيوائهم حتى
              مغادرتهم إلى المدينة المنورة
              <br />
              - إنشاء وسيلة تواصل بمكتب المطوف لضمان حصول الحجاج على خدمات مريحة
              وسلسة أثناء فترة الإقامة.
              <br />
              - التنسيق مع البعثة الهندية وذلك بشأن العمل على رفاهية الحجاج
              أثناء فترة إقامتهم.
              <br />
              - عمل جولات واجتماعات منتظمة مع الحجاج لضمان عدم وقوع حوادث لاقدر
              الله وضمان راحتهم و الإجابة على جميع تساؤلاتهم وتوفير احتياجاتهم
              المحتملة.
              <br />
              - توفير خدمات إضافية للحجاج إن أمكن وذلك بتنسيق وترتيب زيارات لهم
              لجميع الأماكن المقدسة في فترة إقامتهم.
              <br />- توثيق قائمة بجميع الحجاج المستفيدين من خدمات الوقف وذلك من
              خلال البعثة الهندية في كل سنة.
            </p>
          </div>
        </div>
      </div>
    </PagesLayout>
  );
}
