import MainTitle from "./MainTitle";
import Swal from "sweetalert2";

export default function TheWord() {
  const originalValue = `
    الحمد لله الذي وفق الجادين في طاعته، فوجدوا سعيهم مشكورا وحقق رجاء الراجين برحمته فمنحهم عطاء موفورا، وبسط بساط كرمه للتائبين فأصبح ذنبهم مغفورا، والصلاة والسلام على خير البرية وأزكى البشرية نبينا محمد بن عبدالله وعلى آله وصحبه وسلم تسليمًا كثيراً.
    وبعد :

    بفضل الله تعالى منذ عام 1417 هـ تم صدور قرار تعيني من قبل القاضي في محكمة بمكة المكرمة ك "ناظر أوقاف و أربطة النظام حيدرآباد " بعد وفاة والدي الذي كان ناظراً
    سابقاً ،  لخدمة ضيوف الرحمن في مكة المكرمة ولتأكد من استيفاء شروط الوقف لسكن مجانًا أثناء موسم الحج  .

    سائلين الله أن نكون عند حسن ظن الجميع لخدمة هذا الوقف. 
    و الاهداف الإدارية هي لتطوير الأوقاف بعد متابعة بدائل للأصول، من خلال مؤسسة مسجلة وفقا للأنظمة وذلك تحت إشراف الهيئة العامة للأوقاف، وبالتالي تحسين الإيرادات وضمان المبلغ المنفق على الإقامة المجانية للحجاج القادمين في عمائر مستأجره لموسم الحج. 

    لقد كانت مهمتنا هو إلغاء عملية الاختيار القديمة في الهند المجهولة وجعلها شفافة من خلال اختيار استخدام نظام البعثة الهندية لتحديد الحجاج من 45 مدن تابعة لولاية النظام التي تضم ثلاث ولايات هي تيلانجانا وماهاراشترا وكارناتاكا وعلى وجه الخصوص حجاج من فئة العزيزية . 

    وبُذلت كافة الجهود لتحقيق ما فيه مصلحة الحجاج المستحقين للاستفادة من هذه التسهيلات.

    ومن المتوقع أيضًا أن نكون ملتزمين في السنوات القادمة بزيادة السعة حتى نصل إلى الوقت الذي سيتم فيه استيعاب جميع حجاج ولاية نظام دون أي عملية اقتراع . 

    طوال رحلتي، تلقيت الدعم والإرشاد من السيد زاهد علي خان و دعمه. ولا ننسى حكمة وبركات ودعم النواب خير الدين علي خان الذي قام بالتنسيق مع الناظر لعملية الاقتراع الشفافة 

    وبالتأكيد، كل هذا الاجر يذهب إلى عائلة صاحب السمو نظام بدايتاً من نواب أفضل الدولة نظام الخامس الذي قام بشراء هذه العقارات في القرن الثامن عشر
    و في وقت لاحق من عام 1967، تولى صاحب السمو نظام مير بركات علي خان مكرم جاه بهادور نظام الثامن الذي قام في عهده و إقرار عن طريق والدي السيد /الشريف محمد مضر المحامي و الذي كان مستشار قانوني لمعالي وزير البترول أحمد زكي يماني في مدينة الرياض، بجعل هذه العقارات تسجيلاً ك وقف للحجاج القادمين من ولاية النظام و المسجلة في محكمة مكة المكرمة.
  `

  function handleClick(e) {
    e.preventDefault()

    Swal.fire({
      title: 'كلمة الناظر',
      text: originalValue,
      confirmButtonColor: "#131841",
      confirmButtonText: "اغلاق"
    })
  }

  return (
    <div className="word-section py-4 border-top">
      <MainTitle>كلمة الناظر</MainTitle>
      <div className="container">
        <div className="mt-3 d-flex justify-content-between gap-2 gap-lg-5 content">
          <img src="/leaders/1.jpeg" alt="Leader" width={250} className="rounded-3 shadow-lg" />
          <div className="text">
            <p className="mb-0 text-muted pt-2">
              {originalValue.slice(0, 1050)}...
              <a className="ms-1 text-decoration-none" href="#" onClick={handleClick}>عرض المزيد</a>
            </p>
          </div>
        </div>
      </div>
    </div>
  )
}